# TASK 2

Please attempt the questions that follow in Python

Link to the File: Python Task Dummy Data

Read the csv or excel file. 
Change the datatypes of the column and check the memory usage before and after the change in the data types.
Dump the data into the mysql database.
index the column after the data is inserted.

Note: Please make a note we are dumping the data everyday so first delete the indexing from the table and then insert the data.

Submission can be a document or any IDE Notebook

In [1]:
import pandas as pd
import numpy as np

# 1
Read the csv or excel file

In [2]:
data_rg=pd.read_csv('used_bikes.csv')
data_rg

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha
...,...,...,...,...,...,...,...,...
144,Royal Enfield Standard 350cc,115000.0,Hyderabad,14900.0,First Owner,3.0,350.0,Royal Enfield
145,Honda CB Shine 125cc Disc,65000.0,Mumbai,2000.0,First Owner,3.0,125.0,Honda
146,Honda CB Unicorn ABS 150cc,99000.0,Mumbai,4000.0,First Owner,2.0,150.0,Honda
147,Yamaha YZF-R15 2.0 150cc,68500.0,Delhi,68500.0,Second Owner,7.0,150.0,Yamaha
148,Yamaha YZF-R15 V3 150cc,140000.0,Delhi,2473.0,First Owner,2.0,150.0,Yamaha

In [3]:
data_rg.size

1192

In [4]:
data_rg.shape

(149, 8)

# 2
Change the datatypes of the column and check the memory usage before and after the change in the data types

In [5]:
data_rg.describe()

              price     kms_driven         age        power
count  1.490000e+02     149.000000  149.000000   149.000000
mean   1.163103e+05   23799.644295    5.469799   261.671141
std    1.729468e+05   34311.863035    2.788870   189.247494
min    1.110000e+04       3.000000    1.000000   100.000000
25%    4.500000e+04    9900.000000    3.000000   150.000000
50%    7.000000e+04   17500.000000    5.000000   200.000000
75%    1.071000e+05   29305.000000    7.000000   350.000000
max    1.350000e+06  357000.000000   16.000000  1299.000000

In [6]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 9.4+ KB

In [7]:
data_rg.memory_usage(index=True)

Index          132
bike_name     1192
price         1192
city          1192
kms_driven    1192
owner         1192
age           1192
power         1192
brand         1192
dtype: int64

In [8]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float64
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float64
 4   owner       149 non-null    object
 5   age         149 non-null    float64
 6   power       149 non-null    float64
 7   brand       149 non-null    object
dtypes: float64(4), object(4)
memory usage: 45.0 KB

In [9]:
# datatype used in dataset are float64 and object

In [10]:
#analysing float64 datatpe column

In [11]:
data_rg_float=data_rg.select_dtypes(include=['float64'])#data containing the float64
data_rg_float

        price  kms_driven  age  power
0     35000.0     17654.0  3.0  110.0
1    119900.0     11000.0  4.0  350.0
2    600000.0       110.0  8.0  675.0
3     65000.0     16329.0  4.0  180.0
4     80000.0     10000.0  3.0  150.0
..        ...         ...  ...    ...
144  115000.0     14900.0  3.0  350.0
145   65000.0      2000.0  3.0  125.0
146   99000.0      4000.0  2.0  150.0
147   68500.0     68500.0  7.0  150.0
148  140000.0      2473.0  2.0  150.0

[149 rows x 4 columns]

In [12]:
data_rg_float.describe()

              price     kms_driven         age        power
count  1.490000e+02     149.000000  149.000000   149.000000
mean   1.163103e+05   23799.644295    5.469799   261.671141
std    1.729468e+05   34311.863035    2.788870   189.247494
min    1.110000e+04       3.000000    1.000000   100.000000
25%    4.500000e+04    9900.000000    3.000000   150.000000
50%    7.000000e+04   17500.000000    5.000000   200.000000
75%    1.071000e+05   29305.000000    7.000000   350.000000
max    1.350000e+06  357000.000000   16.000000  1299.000000

In [13]:
data_rg_float['price'].max()

1350000.0

In [14]:
data_rg_float['kms_driven'].max()

357000.0

In [15]:
data_rg_float['age'].max()

16.0

In [16]:
data_rg_float['power'].max()

1299.0

In [17]:
#changing float64 to float32

In [18]:
data_rg['age'] = data_rg['age'].astype('float32')
data_rg['power'] = data_rg['power'].astype('float32')
data_rg['price'] = data_rg['price'].astype('float32')
data_rg['kms_driven'] = data_rg['kms_driven'].astype('float32')

In [19]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    object
 5   age         149 non-null    float32
 6   power       149 non-null    float32
 7   brand       149 non-null    object
dtypes: float32(4), object(4)
memory usage: 7.1+ KB

In [20]:
data_rg.memory_usage()

Index          132
bike_name     1192
price          596
city          1192
kms_driven     596
owner         1192
age            596
power          596
brand         1192
dtype: int64

In [21]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    object
 5   age         149 non-null    float32
 6   power       149 non-null    float32
 7   brand       149 non-null    object
dtypes: float32(4), object(4)
memory usage: 42.7 KB

In [22]:
data_rg.select_dtypes(include=['float32']).memory_usage()

Index         132
price         596
kms_driven    596
age           596
power         596
dtype: int64

In [23]:
#convert float64 to float16

In [24]:
data_rg['age'] = data_rg['age'].astype('float16')
data_rg['power'] = data_rg['power'].astype('float16')
data_rg['price'] = data_rg['price'].astype('float32')# error overflow encountered in cast
data_rg['kms_driven'] = data_rg['kms_driven'].astype('float32')# error overflow encountered in cast

In [25]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    object
 5   age         149 non-null    float16
 6   power       149 non-null    float16
 7   brand       149 non-null    object
dtypes: float16(2), float32(2), object(4)
memory usage: 6.5+ KB

In [26]:
data_rg.memory_usage()

Index          132
bike_name     1192
price          596
city          1192
kms_driven     596
owner         1192
age            298
power          298
brand         1192
dtype: int64

In [27]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    float32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    object
 5   age         149 non-null    float16
 6   power       149 non-null    float16
 7   brand       149 non-null    object
dtypes: float16(2), float32(2), object(4)
memory usage: 42.1 KB

In [28]:
data_rg.select_dtypes(include=['float64','float16','float32']).memory_usage()

Index         132
price         596
kms_driven    596
age           298
power         298
dtype: int64

In [29]:
#convert float to int

In [30]:
data_rg['age'] = data_rg['age'].astype('int8')
data_rg['power'] = data_rg['power'].astype('int16')
data_rg['price'] = data_rg['price'].astype('int32')
data_rg['kms_driven'] = data_rg['kms_driven'].astype('int32')

In [31]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    object
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    object
dtypes: int16(1), int32(2), int8(1), object(4)
memory usage: 6.4+ KB

In [32]:
data_rg.memory_usage()

Index          132
bike_name     1192
price          596
city          1192
kms_driven     596
owner         1192
age            149
power          298
brand         1192
dtype: int64

In [33]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    object
 1   price       149 non-null    int32
 2   city        149 non-null    object
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    object
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    object
dtypes: int16(1), int32(2), int8(1), object(4)
memory usage: 41.9 KB

In [34]:
data_rg.select_dtypes(include=['int8','int16','int32']).memory_usage()

Index         132
price         596
kms_driven    596
age           149
power         298
dtype: int64

In [35]:
#analysing object datatpe column

In [36]:
data_rg_object=data_rg.select_dtypes(include=['object'])#data containing the object datatype
data_rg_object

,bike_name,city,owner,brand
0,TVS Star City Plus Dual Tone 110cc,Ahmedabad,First Owner,TVS
1,Royal Enfield Classic 350cc,Delhi,First Owner,Royal Enfield
2,Triumph Daytona 675R,Delhi,First Owner,Triumph
3,TVS Apache RTR 180cc,Bangalore,First Owner,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,Bangalore,First Owner,Yamaha
...,...,...,...,...
144,Royal Enfield Standard 350cc,Hyderabad,First Owner,Royal Enfield
145,Honda CB Shine 125cc Disc,Mumbai,First Owner,Honda
146,Honda CB Unicorn ABS 150cc,Mumbai,First Owner,Honda
147,Yamaha YZF-R15 2.0 150cc,Delhi,Second Owner,Yamaha
148,Yamaha YZF-R15 V3 150cc,Delhi,First Owner,Yamaha

In [37]:
data_rg_object.select_dtypes(include=['object']).memory_usage()

Index         132
bike_name    1192
city         1192
owner        1192
brand        1192
dtype: int64

In [38]:
data_rg_object['city'].nunique()

39

In [39]:
data_rg_object['owner'].nunique()

3

In [40]:
data_rg_object['brand'].nunique()

15

In [41]:
data_rg_object['bike_name'].nunique()

94

In [42]:
#converting to category type

In [43]:
data_rg['city'] = data_rg['city'].astype('category')
data_rg['owner'] = data_rg['owner'].astype('category')
data_rg['brand'] =data_rg['brand'].astype('category')
data_rg['bike_name'] = data_rg['bike_name'].astype('category')

In [44]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    int32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    category
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    category
dtypes: category(4), int16(1), int32(2), int8(1)
memory usage: 7.2 KB

In [45]:
data_rg.memory_usage()

Index          132
bike_name     3005
price          596
city          1533
kms_driven     596
owner          281
age            149
power          298
brand          825
dtype: int64

In [46]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    int32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    category
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    category
dtypes: category(4), int16(1), int32(2), int8(1)
memory usage: 17.0 KB

In [47]:
#

In [48]:
#final data type and memory size

In [49]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    int32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    category
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    category
dtypes: category(4), int16(1), int32(2), int8(1)
memory usage: 7.2 KB

In [50]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    int32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    int32
 4   owner       149 non-null    category
 5   age         149 non-null    int8
 6   power       149 non-null    int16
 7   brand       149 non-null    category
dtypes: category(4), int16(1), int32(2), int8(1)
memory usage: 17.0 KB

In [51]:
'''Overall memory has been decrease from 9.4 Kb to 7.2 Kb and With deep memory introspection memory has been decrease from 45.0 Kb to 17.0 Kb'''

'Overall memory has been decrease from 9.4 Kb to 7.2 Kb and With deep memory introspection memory has been decrease from 45.0 Kb to 17.0 Kb'

In [52]:
#Changing int datatype to float datatype again as there is little reduction of memory usage

In [53]:
data_rg['age'] = data_rg['age'].astype('float16')
data_rg['power'] = data_rg['power'].astype('float16')
data_rg['price'] = data_rg['price'].astype('float32')
data_rg['kms_driven'] = data_rg['kms_driven'].astype('float32')

In [54]:
#final data type(float) and memory size

In [55]:
data_rg.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    float32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    category
 5   age         149 non-null    float16
 6   power       149 non-null    float16
 7   brand       149 non-null    category
dtypes: category(4), float16(2), float32(2)
memory usage: 7.4 KB

In [56]:
data_rg.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   149 non-null    category
 1   price       149 non-null    float32
 2   city        149 non-null    category
 3   kms_driven  149 non-null    float32
 4   owner       149 non-null    category
 5   age         149 non-null    float16
 6   power       149 non-null    float16
 7   brand       149 non-null    category
dtypes: category(4), float16(2), float32(2)
memory usage: 17.2 KB

In [57]:
'''Overall memory has been decrease from 9.4 Kb to 7.4 Kb and With deep memory introspection memory has been decrease from 45.0 Kb to 17.2 Kb'''

'Overall memory has been decrease from 9.4 Kb to 7.4 Kb and With deep memory introspection memory has been decrease from 45.0 Kb to 17.2 Kb'

In [58]:
#Obsevations:
'''Converting the Object type to Category type for columns with very low cardinality is bettercolumns like bike_name and city here in this example have increased the memory size on conversion to category type - high cardinalitywhile the column owner have reduced it size to 1/4 and the brand column have reduced a little'''

'Converting the Object type to Category type for columns with very low cardinality is bettercolumns like bike_name and city here in this example have increased the memory size on conversion to category type - high cardinalitywhile the column owner have reduced it size to 1/4 and the brand column have reduced a little'

# 3
Dump the data into the mysql database.

In [2]:
import mysql.connector

In [4]:
conn_db_rg=mysql.connector.connect(
    host="localhost",
    user="Ritika",
    password="ritika16",
    database="db_bike"
)

In [61]:
cursor=conn_db_rg.cursor()

In [62]:
create_table_query='''
CREATE TABLE use_bike_rg (
    bike_name varchar(200),
    price FLOAT(10, 2),
    city varchar(50),
    kms_driven FLOAT(10, 2),
    owner varchar(100),
    age FLOAT(10, 2),
    power FLOAT(10, 2),
    brand varchar(50)
)
'''

In [63]:
cursor.execute(create_table_query)

In [64]:
drop_index_query='''
DROP INDEX used_bike_index ON use_bike_rg
'''
cursor.execute(drop_index_query)
conn_db_rg.commit()

In [65]:
insert_query='''
INSERT INTO use_bike_rg (bike_name,price,city,kms_driven,owner,age,power,brand)
VALUES ('TVS Star City Plus Dual Tone 110cc',35000, 'Ahmedabad',17654,'First Owner',3,110,'TVS')
'''

In [66]:
cursor.execute(insert_query)

# 4
index the column after the data is inserted.

In [67]:
load_data_query = '''
LOAD DATA INFILE 'used_bikes.csv'
INTO TABLE use_bike_rg
FIELDS TERMINATED BY ',' 
ENCLOSED BY '"'
LINES TERMINATED BY '\n'
IGNORE 2 LINES
'''

In [68]:
cursor.execute(load_data_query)

In [69]:
create_index_query='''
CREATE INDEX used_bikename_index ON use_bike_rg(bike_name)
'''

In [70]:
cursor.execute(create_index_query)

In [71]:
create_index_query2='''
CREATE INDEX used_pr_index ON use_bike_rg(price)
'''

In [72]:
cursor.execute(create_index_query2)

In [73]:
create_index_query3='''
CREATE INDEX used_ciy_index ON use_bike_rg(city)
'''

In [74]:
cursor.execute(create_index_query3)

In [75]:
create_index_query4='''
CREATE INDEX used_km_index ON use_bike_rg(kms_driven)
'''

In [76]:
cursor.execute(create_index_query4)

In [77]:
create_index_query5='''
CREATE INDEX used_own_index ON use_bike_rg(owner)
'''

In [78]:
cursor.execute(create_index_query5)

In [79]:
create_index_query6='''
CREATE INDEX used_ag_index ON use_bike_rg(age)
'''

In [80]:
cursor.execute(create_index_query6)

In [81]:
create_index_query7='''
CREATE INDEX used_pow_index ON use_bike_rg(power)
'''

In [82]:
cursor.execute(create_index_query7)

In [83]:
create_index_query8='''
CREATE INDEX used_br_index ON use_bike_rg(brand)
'''

In [84]:
cursor.execute(create_index_query8)

In [85]:
conn_db_rg.commit()

In [86]:
cursor.close()

True

In [87]:
conn_db_rg.close()